amritpati14/STM32L476_Discovery/RTE/Device/STM32L476VGTx/STCubeGenerated/Inc/main.h
/********************************************************************************
  * file name		:	main.h
  * author			:
  * date		    :    
  * description	    :         
********************************************************************************/

#ifndef _MAIN_H
#define _MAIN_H



#ifdef __cplusplus
 extern "C" {
#endif

/*************************************Include************************************/
	 
#include "stm32l4xx_hal.h"	  
	 	 
#include "stdio.h"
#include "string.h"	 
	 
#include "arm_math.h"
#include "arm_const_structs.h"	  
	 
#include "bsp_led.h"
#include "bsp_uart.h" 
	 
#include "bsp_flash.h"
#include "bsp_acceler.h"
#include "bsp_gyro.h"	
	 
//#include "bsp_button.h"	  
//#include "bsp_iwdg.h"
#include "bsp_timer.h"
//#include "bsp_oled.h"
//#include "bsp_fir.h"

#include "bsp_cs43l22.h"


/**************************************MACRO*************************************/


#define BUFFER_SIZE					0x100

/*************************************FUNCTION***********************************/		 
		
extern TIM_HandleTypeDef TIM3_Handler;
	
extern UART_HandleTypeDef T_UartHandle;

extern DMA_HandleTypeDef DMA_TIM_IC;	


extern I2C_HandleTypeDef            I2C1_Handle;

extern DMA_HandleTypeDef            hDfsdmDma;
extern DMA_HandleTypeDef            hSaiDma;

extern DFSDM_Channel_HandleTypeDef  DfsdmChannelHandle;
extern DFSDM_Filter_HandleTypeDef   DfsdmFilterHandle;

extern SAI_HandleTypeDef            SaiHandle;



void Error_Handler (void);

void SystemClock_Config(void);

int fputc(int ch, FILE *f);

int fgetc(FILE * f) ;





#ifdef __cplusplus
}
#endif

#endif /* _MAIN_H */







/***********************************END OF FILE**********************************/

